Documents/ЛБ_ПрейскурантПроцентныхСтавок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_ПрейскурантПроцентныхСтавок</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЛБ_ПрейскурантПроцентныхСтавок</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОтветственныйПользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаЛомбарды</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ПриказУсловияПредоставленияЗаймов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВводПоПриказуОтказ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ломбарды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ломбард</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтавкиПроцентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПричинаПрименения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_ПричиныПримененияПроцентнойСхемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СхемаКредитования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусЗалогодателя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_СтатусыЗалогодателей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДиапазонСумм</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ДиапазоныСуммЗайма</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СхемаРасчетаПроцентов</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_СхемыРасчетаПроцентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ставка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЛБ_ПрейскурантПроцентныхСтавок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ПрейскурантПроцентныхСтавок</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПроцентнаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусЗалогодателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СтатусыЗалогодателей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДиапазонСуммЗайма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДиапазоныСуммЗайма</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПричинаПрименения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ПричиныПримененияПроцентнойСхемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДеньНачалаПрименения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыОперацийПриказы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыОперацийПриказы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Базовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Акция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВИП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменитьВИП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ВидыПриказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыПриказа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Проект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ЛБ_Ломбарды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЛБ_Ломбарды</Name>
			<Comment>Ломбарды</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяСхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦентральныйФилиал</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДневнойЛимитВыдачиЗаймов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазовыйЛимитВыдачиЗаймов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерФН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>24</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>id_LX</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЛомбарда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПрефиксВНомереЗБ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧисловой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СхемыКредитования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СхемаКредитования</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ЛБ_ПрейскурантПроцентныхСтавок/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Процедура формирует таблицы по табличным частям документа.
//
Процедура ПодготовитьТаблицыДокумента(ТаблицаСтавок) Экспорт
    Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПрейскурантПроцентныхСтавокСтавкиПроцентов.ПричинаПрименения КАК ПричинаПрименения,
	               |	ЛБ_ПрейскурантПроцентныхСтавокСтавкиПроцентов.СхемаКредитования КАК СхемаКредитования,
	               |	ЛБ_ПрейскурантПроцентныхСтавокСтавкиПроцентов.СтатусЗалогодателя КАК СтатусЗалогодателя,
	               |	ЛБ_ПрейскурантПроцентныхСтавокСтавкиПроцентов.ДиапазонСумм КАК ДиапазонСумм,
	               |	ЛБ_ПрейскурантПроцентныхСтавокСтавкиПроцентов.СхемаРасчетаПроцентов КАК СхемаРасчетаПроцентов,
	               |	ЛБ_ПрейскурантПроцентныхСтавокСтавкиПроцентов.Ставка КАК Ставка
	               |ИЗ
	               |	Документ.ЛБ_ПрейскурантПроцентныхСтавок.СтавкиПроцентов КАК ЛБ_ПрейскурантПроцентныхСтавокСтавкиПроцентов
	               |ГДЕ
	               |	ЛБ_ПрейскурантПроцентныхСтавокСтавкиПроцентов.Ссылка = &Ссылка";
		
	РезультатЗапроса = Запрос.Выполнить();

	// Подготовим таблицу товаров для проведения.
	ТаблицаСтавок = ПодготовитьТаблицуСтавок(РезультатЗапроса);

КонецПроцедуры // ПодготовитьТаблицыДокумента()  

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТоварам - результат запроса по табличной части "Товары",
//  СтруктураШапкиДокумента   - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблиица значений.
//
Функция ПодготовитьТаблицуСтавок(РезультатЗапроса) Экспорт

	ТаблицаЗапроса = РезультатЗапроса.Выгрузить();

	ТаблицаСтавок = ТаблицаЗапроса.Скопировать();
	ТаблицаСтавок.Очистить();
	ТаблицаСтавок.Колонки.Добавить("Ломбард");

	Если Ломбарды.Количество() = 0 Тогда
		ВыборкаЛ = Справочники.ЛБ_Ломбарды.Выбрать();
		Пока ВыборкаЛ.Следующий() Цикл
			Если ВыборкаЛ.ЭтоГруппа тогда
				Продолжить;
			ИначеЕсли ВыборкаЛ.ПометкаУдаления Тогда
				Продолжить;
			КонецЕсли;	

			Для каждого Стр Из  ТаблицаЗапроса Цикл
				Если НЕ ЗначениеЗаполнено(Стр.Ставка) Тогда
					Продолжить;
				КонецЕсли;	        
				НоваяСтр = ТаблицаСтавок.Добавить();
				НоваяСтр.Ломбард = ВыборкаЛ.Ссылка;
				НоваяСтр.ПричинаПрименения = Стр.ПричинаПрименения;
				НоваяСтр.СхемаКредитования = Стр.СхемаКредитования;
				НоваяСтр.СтатусЗалогодателя = Стр.СтатусЗалогодателя;
	            НоваяСтр.ДиапазонСумм = Стр.ДиапазонСумм; 
				НоваяСтр.СхемаРасчетаПроцентов = Стр.СхемаРасчетаПроцентов;
				НоваяСтр.Ставка = Стр.Ставка;
			КонецЦикла;	
		КонецЦикла;	
    Иначе
		Для каждого СтрЛ Из Ломбарды Цикл		
			Для каждого Стр Из  ТаблицаЗапроса Цикл
				Если НЕ ЗначениеЗаполнено(Стр.Ставка) Тогда
					Продолжить;
				КонецЕсли;	 
				НоваяСтр = ТаблицаСтавок.Добавить();
				НоваяСтр.Ломбард = СтрЛ.Ломбард.Ссылка;
				НоваяСтр.ПричинаПрименения = Стр.ПричинаПрименения;
				НоваяСтр.СхемаКредитования = Стр.СхемаКредитования;
				НоваяСтр.СтатусЗалогодателя = Стр.СтатусЗалогодателя;
	            НоваяСтр.ДиапазонСумм = Стр.ДиапазонСумм;  
				НоваяСтр.СхемаРасчетаПроцентов = Стр.СхемаРасчетаПроцентов;
				НоваяСтр.Ставка = Стр.Ставка; 
			КонецЦикла;	
		КонецЦикла;	
	КонецЕсли;	
	
	Возврат ТаблицаСтавок;

КонецФункции // ПодготовитьТаблицуТоваров()

// По результату запроса по шапке документа формируем движения по регистрам.
//
// Параметры: 
//  РежимПроведения           - режим проведения документа (оперативный или неоперативный),
//  СтруктураШапкиДокумента   - выборка из результата запроса по шапке документа,
//  ТаблицаПоТоварам          - таблица значений, содержащая данные для проведения и проверки ТЧ Товары,
//  ТаблицаПоСкидкам          - таблица значений, содержащая данные для проведения и проверки ТЧ Скидки,
//  ТаблицаПоУслугам          - таблица значений, содержащая данные для проведения и проверки ТЧ "Услуги",
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоРегистрам(РежимПроведения, ТаблицаСтавок, Отказ)
	
	Движения.ЛБ_ПрейскурантПроцентныхСтавок.Записывать = Истина;
    Для Каждого ТекСтрокаС Из ТаблицаСтавок Цикл
		Движение = Движения.ЛБ_ПрейскурантПроцентныхСтавок.Добавить();
		Движение.Период = Дата;
		Движение.ДатаНачалаДействия = ?(ДатаНачалаДействия = Дата(1,1,1), Дата, ?(ДатаНачалаДействия < Дата, Дата, ДатаНачалаДействия));
		Движение.Ломбард = ТекСтрокаС.Ломбард;
		Движение.ПричинаПрименения = ТекСтрокаС.ПричинаПрименения;
		Движение.СхемаКредитования = ТекСтрокаС.СхемаКредитования;
		Движение.СтатусЗалогодателя = ТекСтрокаС.СтатусЗалогодателя;
        Движение.ДиапазонСуммЗайма = ТекСтрокаС.ДиапазонСумм;
		Движение.СхемаРасчетаПроцентов = ТекСтрокаС.СхемаРасчетаПроцентов;
		Движение.ПроцентнаяСтавка = ТекСтрокаС.Ставка;
		Движение.Приказ = ЭтотОбъект.Приказ;
	КонецЦикла;
		
КонецПроцедуры // ДвиженияПоРегистрам()

Процедура ЗаполнитьНаОсновании(ДанныеЗаполнения) Экспорт 
	// Заполнение шапки
	Приказ = ДанныеЗаполнения.Ссылка;
	ДатаНачалаДействия = ДанныеЗаполнения.ДатаНачалаДействияПриказа;
	ОтветственныйПользователь = ПараметрыСеанса.ТекущийПользователь; 
	ОтветственныйСотрудник = ПараметрыСеанса.ТекущийСотрудник;

	СтрокаЛомбарды = ДанныеЗаполнения.СтрокаЛомбарды;  
	Ломбарды.Очистить();
	Для Каждого ТекСтрокаЛомбарды Из ДанныеЗаполнения.Ломбарды Цикл
		НоваяСтрока = Ломбарды.Добавить();
		НоваяСтрока.Ломбард = ТекСтрокаЛомбарды.Ломбард;
	КонецЦикла;    
	СтавкиПроцентов.Очистить();
	Для Каждого ТекСтрокаС Из ДанныеЗаполнения.СтавкиПроцентов Цикл
		НоваяСтр = СтавкиПроцентов.Добавить();
		НоваяСтр.ПричинаПрименения = ТекСтрокаС.ПричинаПрименения;
		НоваяСтр.СхемаКредитования = ТекСтрокаС.СхемаКредитования;
		НоваяСтр.СтатусЗалогодателя = ТекСтрокаС.СтатусЗалогодателя;
        НоваяСтр.ДиапазонСумм = ТекСтрокаС.ДиапазонСумм;  
		НоваяСтр.СхемаРасчетаПроцентов = ТекСтрокаС.СхемаРасчетаПроцентов;
		НоваяСтр.Ставка = ТекСтрокаС.Ставка;
    КонецЦикла;
 КонецПроцедуры

#Область ОбработчикиСобытий
// Процедура - обработчик события "ОбработкаУдаленияПроведения".
//
Процедура ОбработкаУдаленияПроведения(Отказ)

	ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	ЛБ_ОбщийМодуль.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Перем ТаблицаСтавок;
	
	ПодготовитьТаблицыДокумента(ТаблицаСтавок);
		
	// Движения по документу.
	Если НЕ Отказ Тогда
		
		ДвиженияПоРегистрам(РежимПроведения, ТаблицаСтавок, Отказ);
		
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если (ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЛБ_ПриказУсловияПредоставленияЗаймов")) И (ДанныеЗаполнения.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.Базовый) Тогда 
		Если НЕ ДанныеЗаполнения.Проведен Тогда 
			ЭтотОбъект.ВводПоПриказуОтказ = Истина;
			Сообщить("Ошибка! Прейскуранта процентных ставок не может быть введен на основании не проведенного документа!", СтатусСообщения.Важное);
			Возврат; 	
		ИначеЕсли ДанныеЗаполнения.ВидПриказа = Перечисления.ЛБ_ВидыПриказа.Проект Тогда
			ЭтотОбъект.ВводПоПриказуОтказ = Истина;
			Сообщить("Ошибка! Прейскуранта процентных ставок не может быть введен на основании проекта приказа!", СтатусСообщения.Важное);
			Возврат; 	
		КонецЕсли;
		ЗаполнитьНаОсновании(ДанныеЗаполнения);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#КонецЕсли
